In [2]:
import pandas as pd
nba = pd.read_csv('nba_all_elo.csv')
laptops = pd.read_csv('laptops.csv')
type(nba)

pandas.core.frame.DataFrame

In [3]:
pd.set_option("display.max.columns", None)
# nba.head(5)

In [4]:
pd.set_option("display.precision", 2)
nba.info()  # gets columns with their data type

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 126314 entries, 0 to 126313
Data columns (total 23 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   gameorder      126314 non-null  int64
 1   game_id        126314 non-null  object
 2   lg_id          126314 non-null  object
 3   _iscopy        126314 non-null  int64
 4   year_id        126314 non-null  int64
 5   date_game      126314 non-null  object
 6   seasongame     126314 non-null  int64
 7   is_playoffs    126314 non-null  int64
 8   team_id        126314 non-null  object
 9   fran_id        126314 non-null  object
 10  pts            126314 non-null  int64
 11  elo_i          126314 non-null  float64
 12  elo_n          126314 non-null  float64
 13  win_equiv      126314 non-null  float64
 14  opp_id         126314 non-null  object
 15  opp_fran       126314 non-null  object
 16  opp_pts        126314 non-null  int64
 17  opp_elo_i      126314 non-null  float64
 18  opp_elo_n      126314 non-null  float64
 19  game_location  126314 non-null  object
 20  game_result    126314 non-null  object
 21  forecast       126314 non-null  float64
 22  notes          5424 non-null    object
dtypes: float64(6), int64(7), object(10)
memory usage: 22.2+ MB

In [5]:
nba.describe()

,gameorder,_iscopy,year_id,seasongame,is_playoffs,pts,elo_i,elo_n,win_equiv,opp_pts,opp_elo_i,opp_elo_n,forecast
count,126314.00,126314.0,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00,126314.00
mean,31579.00,0.5,1988.20,43.53,0.06,102.73,1495.24,1495.24,41.71,102.73,1495.24,1495.24,0.50
std,18231.93,0.5,17.58,25.38,0.24,14.81,112.14,112.46,10.63,14.81,112.14,112.46,0.22
min,1.00,0.0,1947.00,1.00,0.00,0.00,1091.64,1085.77,10.15,0.00,1091.64,1085.77,0.02
25%,15790.00,0.0,1975.00,22.00,0.00,93.00,1417.24,1416.99,34.10,93.00,1417.24,1416.99,0.33
50%,31579.00,0.5,1990.00,43.00,0.00,103.00,1500.95,1500.95,42.11,103.00,1500.95,1500.95,0.50
75%,47368.00,1.0,2003.00,65.00,0.00,112.00,1576.06,1576.29,49.64,112.00,1576.06,1576.29,0.67
max,63157.00,1.0,2015.00,108.00,1.00,186.00,1853.10,1853.10,71.11,186.00,1853.10,1853.10,0.98

In [6]:
nba['team_id'].value_counts()

BOS    5997
NYK    5769
LAL    5078
DET    4985
PHI    4533
       ...
INJ      60
PIT      60
DTF      60
TRH      60
SDS      11
Name: team_id, Length: 104, dtype: int64

In [7]:
nba['fran_id'].value_counts()

Lakers          6024
Celtics         5997
Knicks          5769
Warriors        5657
Pistons         5650
Sixers          5644
Hawks           5572
Kings           5475
Wizards         4582
Spurs           4309
Bulls           4307
Pacers          4227
Thunder         4178
Rockets         4154
Nuggets         4120
Nets            4106
Suns            4080
Bucks           4034
Trailblazers    3870
Cavaliers       3810
Clippers        3733
Jazz            3555
Mavericks       3013
Heat            2371
Pelicans        2254
Magic           2207
Timberwolves    2131
Grizzlies       1657
Raptors         1634
Hornets          894
Colonels         846
Squires          799
Spirits          777
Stars            756
Sounds           697
Baltimore        467
Floridians       440
Condors          430
Capitols         291
Olympians        282
Sails            274
Stags            260
Bombers          249
Steamrollers     168
Packers           72
Redskins          65
Rebels            63
Waterloo          62
Denver            62
Falcons           60
Jets              60
Ironmen           60
Huskies           60
Name: fran_id, dtype: int64

In [8]:
nba.loc[nba['fran_id'] == 'Lakers', 'team_id'].value_counts() # locating a particular set of cells

LAL    5078
MNL     946
Name: team_id, dtype: int64

In [9]:
nba['date_played'] = pd.to_datetime(nba['date_game'])

In [10]:
mnl_datePlayed = nba.loc[nba['team_id'] == 'MNL', 'date_played']
min_date = nba.loc[nba['team_id'] == 'MNL', 'date_played'].min()
max_date = nba.loc[nba['team_id'] == 'MNL', 'date_played'].max()
# print(f'{min_date}, {max_date}')
mnl_datePlayed.aggregate((min, max))

min   1948-11-04
max   1960-03-26
Name: date_played, dtype: datetime64[ns]

In [11]:
nba.loc[nba['team_id'] == 'BOS', 'game_id'].count() # total no of games played

5997

In [12]:
nba.loc[nba['team_id'] == 'BOS', 'pts'].sum()

626484

Understanding data structures of Pandas dataframe

In [13]:
numbers = pd.Series([21355, 37732, 251326, 43627])
numbers.index

RangeIndex(start=0, stop=4, step=1)

In [14]:
import numpy as np
revenues = np.array([21355, 37732, 251326, 43627])
cities = np.array(['New York', 'Delhi', 'Hyderabad', 'Bangalore'])
city_revenues = pd.Series(
    revenues, cities # panda series
)
city_revenues

New York      21355
Delhi         37732
Hyderabad    251326
Bangalore     43627
dtype: int32

In [15]:
city_employee_count = pd.Series({'New York': 10, 'Delhi': 16, 'Hyderabad' : 13, 'Bangalore' : 14}) 
# pandas series using dictionary
city_employee_count

New York     10
Delhi        16
Hyderabad    13
Bangalore    14
dtype: int64

In [16]:
city_data = pd.DataFrame({
    'Revenue':city_revenues,
    'Employee_count': city_employee_count
})
# city_data.index = [i+1 for i in range(len(city_data))]
city_data

           Revenue  Employee_count
New York     21355              10
Delhi        37732              16
Hyderabad   251326              13
Bangalore    43627              14

In [17]:
city_data.axes

[Index(['New York', 'Delhi', 'Hyderabad', 'Bangalore'], dtype='object'),
 Index(['Revenue', 'Employee_count'], dtype='object')]

In [18]:
city_data.axes[0]

Index(['New York', 'Delhi', 'Hyderabad', 'Bangalore'], dtype='object')

In [19]:
city_data.axes[1]

Index(['Revenue', 'Employee_count'], dtype='object')

In [20]:
city_data.keys()

Index(['Revenue', 'Employee_count'], dtype='object')

In [21]:
'New York' in cities

True

In [22]:
nba.axes
'points' in nba.keys()

False

Label index and positional index

In [23]:
print(city_revenues[2], city_revenues['Hyderabad'])

251326 251326

In [24]:
colors = pd.Series(["red", "purple", "blue", "green", "yellow"], index=[1, 2, 3, 5, 8] )
colors.loc[3] # returns blue (Label index)

'blue'

In [25]:
colors.iloc[3] # returns green (Positional index)

'green'

In [64]:
city_data.iloc[0]

Revenue           21355
Employee_count       10
Name: New York, dtype: int64

In [65]:
nba.iloc[-2]

gameorder                      63157
game_id                 201506170CLE
lg_id                            NBA
_iscopy                            0
year_id                         2015
date_game                  6/16/2015
seasongame                       102
is_playoffs                        1
team_id                          CLE
fran_id                    Cavaliers
pts                               97
elo_i                        1700.74
elo_n                        1692.09
win_equiv                      59.29
opp_id                           GSW
opp_fran                    Warriors
opp_pts                          105
opp_elo_i                    1813.63
opp_elo_n                    1822.29
game_location                      H
game_result                        L
forecast                        0.48
notes                            NaN
date_played      2015-06-16 00:00:00
Name: 126312, dtype: object

In [66]:
city_data.loc['New York':'Delhi', 'Employee_count']

New York    10
Delhi       16
Name: Employee_count, dtype: int64

In [76]:
nba.loc[5555:5559, ['fran_id', 'opp_fran', 'pts']]

      fran_id  opp_fran  pts
5555  Pistons  Warriors   83
5556  Celtics    Knicks   95
5557   Knicks   Celtics   74
5558    Kings    Sixers   81
5559   Sixers     Kings   86

In [78]:
this_decade = nba[nba['year_id'] > 2010]
this_decade.shape

(12658, 24)

In [81]:
games_with_notes = nba[nba['notes'].notnull()] # also notna()
games_with_notes.shape

(5424, 24)

In [86]:
team_end_ers = nba[nba['fran_id'].str.endswith('ers')]
team_end_ers.shape

(27797, 24)

In [88]:
nba[
    (nba["_iscopy"] == 0)  &
    (nba["pts"] > 100) &
    (nba['opp_pts'] > 100) &
    (nba['team_id'] == "BLB")
]

,gameorder,game_id,lg_id,_iscopy,year_id,date_game,seasongame,is_playoffs,team_id,fran_id,pts,elo_i,elo_n,win_equiv,opp_id,opp_fran,opp_pts,opp_elo_i,opp_elo_n,game_location,game_result,forecast,notes,date_played
1726,864,194902260BLB,NBA,0,1949,2/26/1949,53,0,BLB,Baltimore,114,1421.94,1419.43,38.56,MNL,Lakers,115,1637.99,1640.49,H,L,0.34,NaN,1949-02-26
4890,2446,195301100BLB,NBA,0,1953,01-10-1953,32,0,BLB,Baltimore,126,1328.67,1356.65,25.80,BOS,Celtics,105,1591.14,1563.17,H,W,0.28,NaN,1953-01-10
4909,2455,195301140BLB,NBA,0,1953,1/14/1953,34,0,BLB,Baltimore,104,1349.83,1346.36,24.88,MNL,Lakers,112,1665.44,1668.91,H,L,0.22,NaN,1953-01-14
5208,2605,195303110BLB,NBA,0,1953,03-11-1953,66,0,BLB,Baltimore,107,1284.52,1282.24,19.58,NYK,Knicks,113,1649.15,1651.44,H,L,0.18,at Boston MA,1953-03-11
5825,2913,195402220BLB,NBA,0,1954,2/22/1954,60,0,BLB,Baltimore,110,1303.75,1301.97,20.74,BOS,Celtics,111,1591.49,1593.27,H,L,0.25,at Worcester MA,1954-02-22